## Update .xls

In [1]:
import pandas as pd
import sqlite3

In [ ]:
df = pd.read_excel('../data/Tennis Major Results.xlsx', sheet_name=2)

In [ ]:
df.head()

In [ ]:
df.columns

### Novak Djokovic

In [ ]:
djoker = df[df['PLAYER'] == 'Djokovic, Novak'].copy()
djoker['QF Appears'] += 2
djoker['QF Wins'] += 2
djoker['SF Wins'] += 2
djoker['F Wins'] += 1
djoker['F Losses'] += 1
djoker['QF Pct'] = djoker['QF Wins'] / djoker['QF Appears']
djoker['SF Pct'] = djoker['SF Wins'] / djoker['QF Wins']
djoker['F Pct'] = djoker['F Wins'] / djoker['SF Wins']

In [ ]:
djoker['Wim QF Appears'] += 1
djoker['Wim QF Wins'] += 1
djoker['Wim SF Wins'] += 1
djoker['Wim F Wins'] += 1
djoker['Wim QF Pct'] = djoker['Wim QF Wins'] / djoker['Wim QF Appears']
djoker['Wim SF Pct'] = djoker['Wim SF Wins'] / djoker['Wim QF Wins']
djoker['Wim F Pct'] = djoker['Wim F Wins'] / djoker['Wim SF Wins']
djoker['US QF Appears'] += 1
djoker['US QF Wins'] += 1
djoker['US SF Wins'] += 1
djoker['US F Losses'] += 1
djoker['US QF Pct'] = djoker['US QF Wins'] / djoker['US QF Appears']
djoker['US SF Pct'] = djoker['US SF Wins'] / djoker['US QF Wins']
djoker['US F Pct'] = djoker['US F Wins'] / djoker['US SF Wins']

In [ ]:
df[df['PLAYER'] == 'Djokovic, Novak'] = djoker

### Matteo Berrettini

In [ ]:
berrettini = df[df['PLAYER'] == 'Berrettini, Matteo'].copy()
berrettini['QF Appears'] += 2
berrettini['QF Wins'] += 1
berrettini['QF Losses'] += 1
berrettini['SF Wins'] += 1
berrettini['F Losses'] += 1
berrettini['QF Pct'] = berrettini['QF Wins'] / berrettini['QF Appears']
berrettini['SF Pct'] = berrettini['SF Wins'] / berrettini['QF Wins']
berrettini['F Pct'] = berrettini['F Wins'] / berrettini['SF Wins']

berrettini['Wim QF Appears'] += 1
berrettini['Wim QF Wins'] += 1
berrettini['Wim SF Wins'] += 1
berrettini['Wim F Losses'] += 1
berrettini['Wim QF Pct'] = berrettini['Wim QF Wins'] / berrettini['Wim QF Appears']
berrettini['Wim SF Pct'] = berrettini['Wim SF Wins'] / berrettini['Wim QF Wins']
berrettini['Wim F Pct'] = berrettini['Wim F Wins'] / berrettini['Wim SF Wins']
berrettini['US QF Appears'] += 1
berrettini['US QF Losses'] += 1
berrettini['US QF Pct'] = berrettini['US QF Wins'] / berrettini['US QF Appears']

df[df['PLAYER'] == 'Berrettini, Matteo'] = berrettini

### Denis Shapovalov

In [ ]:
shapovalov = df[df['PLAYER'] == 'Shapovalov, Denis'].copy()
shapovalov['QF Appears'] += 1
shapovalov['QF Wins'] += 1
shapovalov['SF Losses'] += 1
shapovalov['QF Pct'] = shapovalov['QF Wins'] / shapovalov['QF Appears']
shapovalov['SF Pct'] = shapovalov['SF Wins'] / shapovalov['QF Wins']

shapovalov['Wim QF Appears'] += 1
shapovalov['Wim QF Wins'] += 1
shapovalov['Wim SF Losses'] += 1
shapovalov['Wim QF Pct'] = shapovalov['Wim QF Wins'] / shapovalov['Wim QF Appears']
shapovalov['Wim SF Pct'] = shapovalov['Wim SF Wins'] / shapovalov['Wim QF Wins']

df[df['PLAYER'] == 'Shapovalov, Denis'] = shapovalov

### Hubert Hurkacz

In [ ]:
df = df.append({'PLAYER': 'Hurkacz, Hubert', 'QF Appears': 1, 'QF Wins': 1, 'QF Losses': 0,
          'SF Wins': 0, 'SF Losses': 1, 'F Wins': 0, 'F Losses': 0, 'QF Pct': 1,
          'SF Pct': 0, 'F Pct': 0, 'Aus QF Appears': 0, 'Aus QF Wins': 0,
          'Aus QF Losses': 0, 'Aus SF Wins': 0, 'Aus SF Losses': 0, 'Aus F Wins': 0,
          'Aus F Losses': 0, 'Aus QF Pct': 0, 'Aus SF Pct': 0, 'Aus F Pct': 0,
          'Fr QF Appears': 0, 'Fr QF Wins': 0, 'Fr QF Losses': 0, 'Fr SF Wins': 0,
          'Fr SF Losses': 0, 'Fr F Wins': 0, 'Fr F Losses': 0, 'Fr QF Pct': 0,
          'Fr SF Pct': 0, 'Fr F Pct': 0, 'Wim QF Appears': 1, 'Wim QF Wins': 1,
          'Wim QF Losses': 0, 'Wim SF Wins': 0, 'Wim SF Losses': 1, 'Wim F Wins': 0,
          'Wim F Losses': 0, 'Wim QF Pct': 1, 'Wim SF Pct': 0, 'Wim F Pct': 0,
          'US QF Appears': 0, 'US QF Wins': 0, 'US QF Losses': 0, 'US SF Wins': 0,
          'US SF Losses': 0, 'US F Wins': 0, 'US F Losses': 0, 'US QF Pct': 0,
          'US SF Pct': 0, 'US F Pct': 0}, ignore_index=True)

### Marton Fucsovics

In [ ]:
df = df.append({'PLAYER': 'Fucsovics, Marton', 'QF Appears': 1, 'QF Wins': 0, 'QF Losses': 1,
          'SF Wins': 0, 'SF Losses': 0, 'F Wins': 0, 'F Losses': 0, 'QF Pct': 0,
          'SF Pct': 0, 'F Pct': 0, 'Aus QF Appears': 0, 'Aus QF Wins': 0,
          'Aus QF Losses': 0, 'Aus SF Wins': 0, 'Aus SF Losses': 0, 'Aus F Wins': 0,
          'Aus F Losses': 0, 'Aus QF Pct': 0, 'Aus SF Pct': 0, 'Aus F Pct': 0,
          'Fr QF Appears': 0, 'Fr QF Wins': 0, 'Fr QF Losses': 0, 'Fr SF Wins': 0,
          'Fr SF Losses': 0, 'Fr F Wins': 0, 'Fr F Losses': 0, 'Fr QF Pct': 0,
          'Fr SF Pct': 0, 'Fr F Pct': 0, 'Wim QF Appears': 1, 'Wim QF Wins': 0,
          'Wim QF Losses': 1, 'Wim SF Wins': 0, 'Wim SF Losses': 0, 'Wim F Wins': 0,
          'Wim F Losses': 0, 'Wim QF Pct': 0, 'Wim SF Pct': 0, 'Wim F Pct': 0,
          'US QF Appears': 0, 'US QF Wins': 0, 'US QF Losses': 0, 'US SF Wins': 0,
          'US SF Losses': 0, 'US F Wins': 0, 'US F Losses': 0, 'US QF Pct': 0,
          'US SF Pct': 0, 'US F Pct': 0}, ignore_index=True)

### Karen Khachanov

In [ ]:
khachanov = df[df['PLAYER'] == 'Khachanov, Karen'].copy()
khachanov['QF Appears'] += 1
khachanov['QF Losses'] += 1
khachanov['QF Pct'] = khachanov['QF Wins'] / khachanov['QF Appears']

khachanov['Wim QF Appears'] += 1
khachanov['Wim QF Losses'] += 1
khachanov['Wim QF Pct'] = khachanov['Wim QF Wins'] / khachanov['Wim QF Appears']

df[df['PLAYER'] == 'Khachanov, Karen'] = khachanov

### Felix Auger-Aliassime

In [ ]:
df = df.append({'PLAYER': 'Auger-Aliassime, Felix', 'QF Appears': 1, 'QF Wins': 0,
                'QF Losses': 1,
          'SF Wins': 0, 'SF Losses': 0, 'F Wins': 0, 'F Losses': 0, 'QF Pct': 0,
          'SF Pct': 0, 'F Pct': 0, 'Aus QF Appears': 0, 'Aus QF Wins': 0,
          'Aus QF Losses': 0, 'Aus SF Wins': 0, 'Aus SF Losses': 0, 'Aus F Wins': 0,
          'Aus F Losses': 0, 'Aus QF Pct': 0, 'Aus SF Pct': 0, 'Aus F Pct': 0,
          'Fr QF Appears': 0, 'Fr QF Wins': 0, 'Fr QF Losses': 0, 'Fr SF Wins': 0,
          'Fr SF Losses': 0, 'Fr F Wins': 0, 'Fr F Losses': 0, 'Fr QF Pct': 0,
          'Fr SF Pct': 0, 'Fr F Pct': 0, 'Wim QF Appears': 1, 'Wim QF Wins': 0,
          'Wim QF Losses': 1, 'Wim SF Wins': 0, 'Wim SF Losses': 0, 'Wim F Wins': 0,
          'Wim F Losses': 0, 'Wim QF Pct': 0, 'Wim SF Pct': 0, 'Wim F Pct': 0,
          'US QF Appears': 0, 'US QF Wins': 0, 'US QF Losses': 0, 'US SF Wins': 0,
          'US SF Losses': 0, 'US F Wins': 0, 'US F Losses': 0, 'US QF Pct': 0,
          'US SF Pct': 0, 'US F Pct': 0}, ignore_index=True)

In [ ]:
augeraliassime = df[df['PLAYER'] == 'Auger-Aliassime, Felix'].copy()
augeraliassime['QF Appears'] += 1
augeraliassime['QF Wins'] += 1
augeraliassime['SF Losses'] += 1
augeraliassime['QF Pct'] = augeraliassime['QF Wins'] / augeraliassime['QF Appears']
augeraliassime['SF Pct'] = augeraliassime['SF Wins'] / augeraliassime['QF Wins']

augeraliassime['US QF Appears'] += 1
augeraliassime['US QF Wins'] += 1
augeraliassime['US SF Losses'] += 1
augeraliassime['US QF Pct'] = augeraliassime['US QF Wins'] / augeraliassime['US QF Appears']
augeraliassime['US SF Pct'] = augeraliassime['US SF Wins'] / augeraliassime['US QF Wins']

df[df['PLAYER'] == 'Auger-Aliassime, Felix'] = augeraliassime

### Roger Federer

In [ ]:
federer = df[df['PLAYER'] == 'Federer, Roger'].copy()
federer['QF Appears'] += 1
federer['QF Losses'] += 1
federer['QF Pct'] = federer['QF Wins'] / federer['QF Appears']

federer['Wim QF Appears'] += 1
federer['Wim QF Losses'] += 1
federer['Wim QF Pct'] = federer['Wim QF Wins'] / federer['Wim QF Appears']

df[df['PLAYER'] == 'Federer, Roger'] = federer

### Daniil Medvedev

In [ ]:
medvedev = df[df['PLAYER'] == 'Medvedev, Daniil'].copy()
medvedev['QF Appears'] += 1
medvedev['QF Wins'] += 1
medvedev['SF Wins'] += 1
medvedev['F Wins'] += 1
medvedev['QF Pct'] = medvedev['QF Wins'] / medvedev['QF Appears']
medvedev['SF Pct'] = medvedev['SF Wins'] / medvedev['QF Wins']
medvedev['F Pct'] = medvedev['F Wins'] / medvedev['SF Wins']

medvedev['US QF Appears'] += 1
medvedev['US QF Wins'] += 1
medvedev['US SF Wins'] += 1
medvedev['US F Wins'] += 1
medvedev['US QF Pct'] = medvedev['US QF Wins'] / medvedev['US QF Appears']
medvedev['US SF Pct'] = medvedev['US SF Wins'] / medvedev['US QF Wins']
medvedev['US F Pct'] = medvedev['US F Wins'] / medvedev['US SF Wins']

df[df['PLAYER'] == 'Medvedev, Daniil'] = medvedev

### Alexander Zverev

In [ ]:
zverev = df[df['PLAYER'] == 'Zverev, Alexander'].copy()
zverev['QF Appears'] += 1
zverev['QF Wins'] += 1
zverev['SF Losses'] += 1
zverev['QF Pct'] = zverev['QF Wins'] / zverev['QF Appears']
zverev['SF Pct'] = zverev['SF Wins'] / zverev['QF Wins']

zverev['US QF Appears'] += 1
zverev['US QF Wins'] += 1
zverev['US SF Losses'] += 1
zverev['US QF Pct'] = zverev['US QF Wins'] / zverev['US QF Appears']
zverev['US SF Pct'] = zverev['US SF Wins'] / zverev['US QF Wins']

df[df['PLAYER'] == 'Zverev, Alexander'] = zverev

### Lloyd Harris

In [ ]:
df = df.append({'PLAYER': 'Harris, Lloyd', 'QF Appears': 1, 'QF Wins': 0,
                'QF Losses': 1,
          'SF Wins': 0, 'SF Losses': 0, 'F Wins': 0, 'F Losses': 0, 'QF Pct': 0,
          'SF Pct': 0, 'F Pct': 0, 'Aus QF Appears': 0, 'Aus QF Wins': 0,
          'Aus QF Losses': 0, 'Aus SF Wins': 0, 'Aus SF Losses': 0, 'Aus F Wins': 0,
          'Aus F Losses': 0, 'Aus QF Pct': 0, 'Aus SF Pct': 0, 'Aus F Pct': 0,
          'Fr QF Appears': 0, 'Fr QF Wins': 0, 'Fr QF Losses': 0, 'Fr SF Wins': 0,
          'Fr SF Losses': 0, 'Fr F Wins': 0, 'Fr F Losses': 0, 'Fr QF Pct': 0,
          'Fr SF Pct': 0, 'Fr F Pct': 0, 'Wim QF Appears': 0, 'Wim QF Wins': 0,
          'Wim QF Losses': 0, 'Wim SF Wins': 0, 'Wim SF Losses': 0, 'Wim F Wins': 0,
          'Wim F Losses': 0, 'Wim QF Pct': 0, 'Wim SF Pct': 0, 'Wim F Pct': 0,
          'US QF Appears': 1, 'US QF Wins': 0, 'US QF Losses': 1, 'US SF Wins': 0,
          'US SF Losses': 0, 'US F Wins': 0, 'US F Losses': 0, 'US QF Pct': 0,
          'US SF Pct': 0, 'US F Pct': 0}, ignore_index=True)

### Carlos Alcaraz

In [ ]:
df = df.append({'PLAYER': 'Alcaraz, Carlos', 'QF Appears': 1, 'QF Wins': 0,
                'QF Losses': 1,
          'SF Wins': 0, 'SF Losses': 0, 'F Wins': 0, 'F Losses': 0, 'QF Pct': 0,
          'SF Pct': 0, 'F Pct': 0, 'Aus QF Appears': 0, 'Aus QF Wins': 0,
          'Aus QF Losses': 0, 'Aus SF Wins': 0, 'Aus SF Losses': 0, 'Aus F Wins': 0,
          'Aus F Losses': 0, 'Aus QF Pct': 0, 'Aus SF Pct': 0, 'Aus F Pct': 0,
          'Fr QF Appears': 0, 'Fr QF Wins': 0, 'Fr QF Losses': 0, 'Fr SF Wins': 0,
          'Fr SF Losses': 0, 'Fr F Wins': 0, 'Fr F Losses': 0, 'Fr QF Pct': 0,
          'Fr SF Pct': 0, 'Fr F Pct': 0, 'Wim QF Appears': 0, 'Wim QF Wins': 0,
          'Wim QF Losses': 0, 'Wim SF Wins': 0, 'Wim SF Losses': 0, 'Wim F Wins': 0,
          'Wim F Losses': 0, 'Wim QF Pct': 0, 'Wim SF Pct': 0, 'Wim F Pct': 0,
          'US QF Appears': 1, 'US QF Wins': 0, 'US QF Losses': 1, 'US SF Wins': 0,
          'US SF Losses': 0, 'US F Wins': 0, 'US F Losses': 0, 'US QF Pct': 0,
          'US SF Pct': 0, 'US F Pct': 0}, ignore_index=True)

### Botic van de Zandschulp

In [ ]:
df = df.append({'PLAYER': 'van de Zandschulp, Botic', 'QF Appears': 1, 'QF Wins': 0,
                'QF Losses': 1,
          'SF Wins': 0, 'SF Losses': 0, 'F Wins': 0, 'F Losses': 0, 'QF Pct': 0,
          'SF Pct': 0, 'F Pct': 0, 'Aus QF Appears': 0, 'Aus QF Wins': 0,
          'Aus QF Losses': 0, 'Aus SF Wins': 0, 'Aus SF Losses': 0, 'Aus F Wins': 0,
          'Aus F Losses': 0, 'Aus QF Pct': 0, 'Aus SF Pct': 0, 'Aus F Pct': 0,
          'Fr QF Appears': 0, 'Fr QF Wins': 0, 'Fr QF Losses': 0, 'Fr SF Wins': 0,
          'Fr SF Losses': 0, 'Fr F Wins': 0, 'Fr F Losses': 0, 'Fr QF Pct': 0,
          'Fr SF Pct': 0, 'Fr F Pct': 0, 'Wim QF Appears': 0, 'Wim QF Wins': 0,
          'Wim QF Losses': 0, 'Wim SF Wins': 0, 'Wim SF Losses': 0, 'Wim F Wins': 0,
          'Wim F Losses': 0, 'Wim QF Pct': 0, 'Wim SF Pct': 0, 'Wim F Pct': 0,
          'US QF Appears': 1, 'US QF Wins': 0, 'US QF Losses': 1, 'US SF Wins': 0,
          'US SF Losses': 0, 'US F Wins': 0, 'US F Losses': 0, 'US QF Pct': 0,
          'US SF Pct': 0, 'US F Pct': 0}, ignore_index=True)

In [ ]:
df = df.sort_values(['F Wins', 'SF Wins', 'QF Wins', 'QF Appears', 'PLAYER'],
              ascending=[False, False, False, False, True])

In [ ]:
df.to_excel('../data/MensSinglesMajorResultsThru2021.xls')

## Make Tennis .db

In [ ]:
import sqlite3

tennis = pd.read_excel('../data/Tennis Major Results.xlsx',
                      sheet_name=2)

tennis.head()

In [ ]:
conn2 = sqlite3.connect('../data/tennis.db')

conn2.execute(
    """SELECT *
    FROM sqlite_master"""
).fetchall()

In [ ]:
tennis2 = tennis.rename(lambda x: x.replace(' ', '_'), axis=1)

tennis2.columns

In [ ]:
tennis3 = tennis2.drop(['QF_Losses', 'SF_Losses', 'F_Losses',
                       'QF_Pct', 'SF_Pct', 'F_Pct', 'Aus_QF_Losses',
                        'Aus_SF_Losses', 'Aus_F_Losses', 'Aus_QF_Pct',
                        'Aus_SF_Pct', 'Aus_F_Pct', 'Fr_QF_Losses',
                        'Fr_SF_Losses', 'Fr_F_Losses', 'Fr_QF_Pct',
                        'Fr_SF_Pct', 'Fr_F_Pct', 'Wim_QF_Losses',
                        'Wim_SF_Losses', 'Wim_F_Losses', 'Wim_QF_Pct',
                        'Wim_SF_Pct', 'Wim_F_Pct', 'US_QF_Losses',
                        'US_SF_Losses', 'US_F_Losses', 'US_QF_Pct',
                        'US_SF_Pct', 'US_F_Pct'
                       ], axis=1)

In [ ]:
tennis3.to_sql('tennis_simple', conn2)

In [ ]:
conn.execute(
    """SELECT *
    FROM sqlite_master"""
).fetchall()

In [ ]:
pd.read_sql(
    """SELECT Player, F_Wins
    FROM tennis"""
, conn)

In [ ]:
pd.read_sql(
    """SELECT *
    FROM tennis_simple"""
, conn2)

In [ ]:
# 2021 Wimble:

# Djokovic
## Berrettini
### Shapovalov, Hurkacz
#### Fucsovics, Khachanov, Auger-Aliassime, Federer

# 2021 US:

# Medvedev
## Djokovic
### Zverev, Auger-Aliassime
#### Berrettini, Harris, Alcaraz, van de Zandschulp

# 2022 Aus:

# Nadal
## Medvedev
### Berrettini, Tsitsipas
#### Monfils, Shapovalov, Sinner, Auger-Aliassime

# UPDATE HERE:
    # Djokovic 1 F Win, 1 SF Win
    # Berrettini 1 SF Win, 1 QF Win, 1 QF Appear
    # Shapovalov 1 QF Win, 1 QF Appear
    # Hurkacz 1 QF Win
    # Fucsovics 1 QF Appear
    # Khachanov 1 QF Appear
    # Auger-Aliassime 1 QF Win, 2 QF Appears
    # Federer 1 QF Appear
    # Medvedev 1 F Win, 1 SF Win
    # Zverev 1 QF Win
    # Harris 1 QF Appear
    # Alcaraz 1 QF Appear
    # van de Zandschulp 1 QF Appear
    # Nadal 1 F Win
    # Tsitsipas 1 QF Win
    # Monfils 1 QF Appear
    # Sinner 1 QF Appear

# 2022 Fr:

# Nadal
## Ruud
### Zverev, Cilic
#### Djokovic, Alcaraz, Rune, Rublev

In [ ]:
conn2.execute(
    """UPDATE tennis_simple
    SET QF_Appears = 51
    WHERE Player = 'Djokovic, Novak'"""
)

In [ ]:
conn2.execute(
    """
    SELECT *
    FROM tennis_simple
    WHERE Player = 'Djokovic, Novak'
    """
).fetchall()

In [ ]:
conn2.execute(
    """
    UPDATE tennis_simple
    SET QF_Appears = 51,
        QF_Wins = 42,
        SF_Wins = 31,
        F_Wins = 20,
        Wim_QF_Appears = 12,
        Wim_QF_Wins = 10,
        Wim_SF_Wins = 7,
        Wim_F_Wins = 6,
        US_QF_Appears = 12,
        US_QF_Wins = 12,
        US_SF_Wins = 9,
        US_F_Wins = 3
    WHERE Player = 'Djokovic, Novak'
    """
)

In [ ]:
conn2.execute(
    """
    SELECT *
    FROM tennis_simple
    WHERE Player = 'Djokovic, Novak'
    """
).fetchall()

In [ ]:
pd.read_sql(
    """
    SELECT *
    FROM tennis_simple
    WHERE Player = 'Djokovic, Novak'
    """
, conn2)

In [ ]:
pd.read_sql(
    """
    SELECT *
    FROM tennis_simple
    WHERE Player = 'Berrettini, Matteo'
    """
, conn2)

In [ ]:
conn2.execute(
    """
    UPDATE tennis_simple
    SET QF_Appears = 5,
        QF_Wins = 3,
        SF_Wins = 1,
        Aus_QF_Appears = 1,
        Aus_QF_Wins = 1,
        Wim_QF_Appears = 1,
        Wim_QF_Wins = 1,
        Wim_SF_Wins = 1,
        US_QF_Appears = 2
        
    WHERE Player = 'Berrettini, Matteo'
    """
)

In [ ]:
pd.read_sql(
    """
    SELECT *
    FROM tennis_simple
    WHERE Player = 'Berrettini, Matteo'
    """
, conn2)

In [ ]:
conn3 = sqlite3.connect('../Sports-Data/tennis.db')

pd.read_sql(
    """
    SELECT *
    FROM tennis_simple
    WHERE Player = 'Berrettini, Matteo'
    """
, conn3)

In [ ]:
conn.close()

In [ ]:
conn2.close()

In [ ]:
conn3.close()

## Updating a Row

In [ ]:
"""
    UPDATE tennis_simple
    SET QF_Appears = 9,
        QF_Wins = 9,
        SF_Wins = 9,
        Aus_QF_Appears = 9,
        Aus_QF_Wins = 9,
        Wim_QF_Appears = 9,
        Wim_QF_Wins = 9,
        Wim_SF_Wins = 9,
        US_QF_Appears = 9
        
    WHERE Player = 'YYY, XXX'
"""

## Adding a Row

In [ ]:
"""
    INSERT INTO tennis_simple
    VALUES ('YYY, XXX', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
"""

## 09-06-22

In [5]:
conn = sqlite3.connect('../data/tennis.db')

In [9]:
pd.read_sql(
    """SELECT *
    FROM sqlite_master""", conn
)

,type,name,tbl_name,rootpage,sql
0,table,mens_tennis,mens_tennis,9,"CREATE TABLE mens_tennis (""index"" INTEGER PRIM..."

In [11]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Djokovic, Novak'
    """,
    conn
)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,2,"Djokovic, Novak",53,43,32,21,12,9,9,9,...,6,2,13,11,8,7,12,12,9,3

## 2022 U.S. Open

In [24]:
import pandas as pd
import sqlite3
con = sqlite3.connect("../data/tennis.db")

In [25]:
# QFs
# Khachanov d. Kyrgios
# Ruud d. Berrettini
# Alcaraz d. Sinner
# Tiafoe d. Rublev

# SFs
# Ruud d. Khachanov
# Alcaraz d. Tiafoe

# Fs
# Alcaraz d. Ruud

In [26]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Khachanov, Karen'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,305,"Khachanov, Karen",2,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0

In [27]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 3,
    QF_Wins = 1,
    US_QF_Appears = 1,
    US_QF_Wins = 1
    
    WHERE Player = 'Khachanov, Karen'
    """
)

In [28]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Kyrgios, Nick'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,236,"Kyrgios, Nick",3,1,1,0,1,0,0,0,...,0,0,2,1,1,0,0,0,0,0

In [29]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 4,
    US_QF_Appears = 1
    
    WHERE Player = 'Kyrgios, Nick'
    """
)

In [30]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Ruud, Casper'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,368,"Ruud, Casper",1,1,1,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0

In [31]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 2,
    QF_Wins = 2,
    SF_Wins = 2,
    US_QF_Appears = 1,
    US_QF_Wins = 1,
    US_SF_Wins = 1
    
    WHERE Player = 'Ruud, Casper'
    """
)

In [32]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Berrettini, Matteo'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,160,"Berrettini, Matteo",5,3,1,0,1,1,0,0,...,0,0,1,1,1,0,2,1,0,0

In [33]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 6,
    US_QF_Appears = 3
    
    WHERE Player = 'Berrettini, Matteo'
    """
)

In [34]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Alcaraz, Carlos'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,365,"Alcaraz, Carlos",2,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0

In [35]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 3,
    QF_Wins = 1,
    SF_Wins = 1,
    F_Wins = 1,
    US_QF_Appears = 2,
    US_QF_Wins = 1,
    US_SF_Wins = 1,
    US_F_Wins = 1
    
    WHERE Player = 'Alcaraz, Carlos'
    """
)

In [36]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Sinner, Jannik'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,343,"Sinner, Jannik",3,0,0,0,1,0,0,0,...,0,0,1,0,0,0,0,0,0,0

In [37]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 4,
    US_QF_Appears = 1
    
    WHERE Player = 'Sinner, Jannik'
    """
)

In [38]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Tiafoe, Frances'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,349,"Tiafoe, Frances",1,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [39]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 2,
    QF_Wins = 1,
    US_QF_Appears = 1,
    US_QF_Wins = 1
    
    WHERE Player = 'Tiafoe, Frances'
    """
)

In [40]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Rublev, Andrey'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,211,"Rublev, Andrey",5,0,0,0,1,0,0,0,...,0,0,0,0,0,0,2,0,0,0

In [41]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 6,
    US_QF_Appears = 3
    
    WHERE Player = 'Rublev, Andrey'
    """
)

In [42]:
con.commit()

In [43]:
con.close()

## 2023 Australian Open

In [1]:
import pandas as pd
import sqlite3
con = sqlite3.connect("../data/tennis.db")

In [3]:
# QFs
# Khachanov d. Korda
# Tsitsipas d. Lehecka
# Djokovic d. Rublev
# Paul d. Shelton

# SFs
# Tsitsipas d. Khachanov
# Djokovic d. Paul

# Fs
# Djokovic d. Tsitsipas

In [4]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Khachanov, Karen'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,305,"Khachanov, Karen",3,1,0,0,0,0,0,0,...,0,0,1,0,0,0,1,1,0,0

In [5]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 4,
    QF_Wins = 2,
    Aus_QF_Appears = 1,
    Aus_QF_Wins = 1
    
    WHERE Player = 'Khachanov, Karen'
    """
)

In [22]:
con.execute(
    """
    SELECT MAX("index")
    FROM mens_tennis
    """
).fetchall()

[(371,)]

In [23]:
con.execute(
    """
    INSERT INTO mens_tennis
    VALUES (372, 'Korda, Sebastian', 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
    """
)

In [24]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Tsitsipas, Stefanos'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,73,"Tsitsipas, Stefanos",5,5,1,0,3,3,0,0,...,1,0,0,0,0,0,0,0,0,0

In [28]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 5,
    QF_Wins = 3,
    SF_Wins = 2,
    Aus_QF_Appears = 2,
    Aus_QF_Wins = 2,
    Aus_SF_Wins = 1
    
    WHERE Player = 'Tsitsipas, Stefanos'
    """
)

In [26]:
con.execute(
    """
    INSERT INTO mens_tennis
    VALUES (373, 'Lehecka, Jiri', 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
    """
)

In [27]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Djokovic, Novak'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,2,"Djokovic, Novak",53,43,32,21,12,9,9,9,...,6,2,13,11,8,7,12,12,9,3

In [30]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 54,
    QF_Wins = 44,
    SF_Wins = 33,
    F_Wins = 22,
    Aus_QF_Appears = 13,
    Aus_QF_Wins = 10,
    Aus_SF_Wins = 10,
    Aus_F_Wins = 10
    
    WHERE Player = 'Djokovic, Novak'
    """
)

In [31]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Rublev, Andrey'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,211,"Rublev, Andrey",6,0,0,0,1,0,0,0,...,0,0,0,0,0,0,3,0,0,0

In [32]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 7,
    Aus_QF_Appears = 2
    
    WHERE Player = 'Rublev, Andrey'
    """
)

In [34]:
con.execute(
    """
    INSERT INTO mens_tennis
    VALUES (374, 'Paul, Tommy', 1, 1, 0, 0, 1, 1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
    """
)

In [36]:
con.execute(
    """
    INSERT INTO mens_tennis
    VALUES (375, 'Shelton, Ben', 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
    """
)

In [37]:
con.commit()

In [38]:
con.close()

## 2023 French Open

In [2]:
# QFs
# Alcaraz d. Tsitsipas
# Djokovic d. Khachanov
# Ruud d. Rune
# Zverev d. Etcheverry

# SFs
# Djokovic d. Alcaraz
# Ruud d. Zverev

# Fs
# Djokovic d. Ruud

In [3]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Alcaraz, Carlos'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,365,"Alcaraz, Carlos",3,1,1,1,0,0,0,0,...,0,0,0,0,0,0,2,1,1,1

In [141]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 4,
    QF_Wins = 2,
    Fr_QF_Appears = 2,
    Fr_QF_Wins = 1,
    Fr_SF_Wins = 0
    
    WHERE Player = 'Alcaraz, Carlos'
    """
)

In [7]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Tsitsipas, Stefanos'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,73,"Tsitsipas, Stefanos",5,3,2,0,2,2,1,0,...,1,0,0,0,0,0,0,0,0,0

In [87]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Tsitsipas, Stefanos'
    """
, con).T

                                  0
index                            73
Player          Tsitsipas, Stefanos
QF_Appears                        5
QF_Wins                           3
SF_Wins                           2
F_Wins                            0
Aus_QF_Appears                    2
Aus_QF_Wins                       2
Aus_SF_Wins                       1
Aus_F_Wins                        0
Fr_QF_Appears                     2
Fr_QF_Wins                        2
Fr_SF_Wins                        1
Fr_F_Wins                         0
Wim_QF_Appears                    0
Wim_QF_Wins                       0
Wim_SF_Wins                       0
Wim_F_Wins                        0
US_QF_Appears                     0
US_QF_Wins                        0
US_SF_Wins                        0
US_F_Wins                         0

In [106]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 7,
    QF_Wins = 6,
    SF_Wins = 2,
    Aus_QF_Appears = 4,
    Aus_QF_Wins = 4,
    Aus_SF_Wins = 1,
    Fr_QF_Appears = 3,
    Fr_QF_Wins = 2,
    Fr_SF_Wins = 1
    
    WHERE Player = 'Tsitsipas, Stefanos'
    """
)

In [88]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Djokovic, Novak'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,2,"Djokovic, Novak",54,44,33,22,13,10,10,10,...,6,2,13,11,8,7,12,12,9,3

In [120]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 55,
    QF_Wins = 45,
    SF_Wins = 34,
    F_Wins = 23,
    Fr_QF_Appears = 17,
    Fr_QF_Wins = 12,
    Fr_SF_Wins = 7,
    Fr_F_wins = 3
    
    WHERE Player = 'Djokovic, Novak'
    """
)

In [89]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Khachanov, Karen'
    """
, con).T

                               0
index                        305
Player          Khachanov, Karen
QF_Appears                     4
QF_Wins                        2
SF_Wins                        0
F_Wins                         0
Aus_QF_Appears                 1
Aus_QF_Wins                    1
Aus_SF_Wins                    0
Aus_F_Wins                     0
Fr_QF_Appears                  1
Fr_QF_Wins                     0
Fr_SF_Wins                     0
Fr_F_Wins                      0
Wim_QF_Appears                 1
Wim_QF_Wins                    0
Wim_SF_Wins                    0
Wim_F_Wins                     0
US_QF_Appears                  1
US_QF_Wins                     1
US_SF_Wins                     0
US_F_Wins                      0

In [103]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 5,
    Fr_QF_Appears = 2
    
    WHERE Player = 'Khachanov, Karen'
    """
)

In [90]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Ruud, Casper'
    """
, con).T

                           0
index                    368
Player          Ruud, Casper
QF_Appears                 2
QF_Wins                    2
SF_Wins                    2
F_Wins                     0
Aus_QF_Appears             0
Aus_QF_Wins                0
Aus_SF_Wins                0
Aus_F_Wins                 0
Fr_QF_Appears              1
Fr_QF_Wins                 1
Fr_SF_Wins                 1
Fr_F_Wins                  0
Wim_QF_Appears             0
Wim_QF_Wins                0
Wim_SF_Wins                0
Wim_F_Wins                 0
US_QF_Appears              1
US_QF_Wins                 1
US_SF_Wins                 1
US_F_Wins                  0

In [98]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 3,
    QF_Wins = 3,
    SF_Wins = 3,
    Fr_QF_Appears = 2,
    Fr_QF_Wins = 2,
    Fr_SF_Wins = 2
    
    WHERE Player = 'Ruud, Casper'
    """
)

In [26]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Rune, Holger'
    """
, con).T

                           0
index                    367
Player          Rune, Holger
QF_Appears                 1
QF_Wins                    0
SF_Wins                    0
F_Wins                     0
Aus_QF_Appears             0
Aus_QF_Wins                0
Aus_SF_Wins                0
Aus_F_Wins                 0
Fr_QF_Appears              1
Fr_QF_Wins                 0
Fr_SF_Wins                 0
Fr_F_Wins                  0
Wim_QF_Appears             0
Wim_QF_Wins                0
Wim_SF_Wins                0
Wim_F_Wins                 0
US_QF_Appears              0
US_QF_Wins                 0
US_SF_Wins                 0
US_F_Wins                  0

In [91]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 2,
    Fr_QF_Appears = 2
    
    WHERE Player = 'Rune, Holger'
    """
)

In [29]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Zverev, Alexander'
    """
, con).T

                                0
index                          77
Player          Zverev, Alexander
QF_Appears                      8
QF_Wins                         5
SF_Wins                         1
F_Wins                          0
Aus_QF_Appears                  2
Aus_QF_Wins                     1
Aus_SF_Wins                     0
Aus_F_Wins                      0
Fr_QF_Appears                   4
Fr_QF_Wins                      2
Fr_SF_Wins                      0
Fr_F_Wins                       0
Wim_QF_Appears                  0
Wim_QF_Wins                     0
Wim_SF_Wins                     0
Wim_F_Wins                      0
US_QF_Appears                   2
US_QF_Wins                      2
US_SF_Wins                      1
US_F_Wins                       0

In [92]:
con.execute(
    """
    UPDATE mens_tennis
    SET QF_Appears = 9,
    QF_Wins = 6,
    Fr_QF_Appears = 5,
    Fr_QF_Wins = 3
    
    WHERE Player = 'Zverev, Alexander'
    """
)

In [37]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player LIKE 'Etcheverry%'
    """
, con)

Empty DataFrame
Columns: [index, Player, QF_Appears, QF_Wins, SF_Wins, F_Wins, Aus_QF_Appears, Aus_QF_Wins, Aus_SF_Wins, Aus_F_Wins, Fr_QF_Appears, Fr_QF_Wins, Fr_SF_Wins, Fr_F_Wins, Wim_QF_Appears, Wim_QF_Wins, Wim_SF_Wins, Wim_F_Wins, US_QF_Appears, US_QF_Wins, US_SF_Wins, US_F_Wins]
Index: []

[0 rows x 22 columns]

In [38]:
con.execute(
    """
    INSERT INTO mens_tennis
    VALUES (376, 'Etcheverry, Tomas', 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
    """
)

In [39]:
con.commit()

In [40]:
pd.read_sql(
    """
    SELECT SUM(QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(QF_Appears)
0             1752

In [42]:
8*4*53 + 8*3*2 + 8*2

1760

In [47]:
pd.read_sql(
    """
    SELECT SUM(Aus_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(Aus_QF_Appears)
0                  438

In [44]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Appears)
0                 441

In [45]:
pd.read_sql(
    """
    SELECT SUM(Wim_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(Wim_QF_Appears)
0                  432

In [46]:
pd.read_sql(
    """
    SELECT SUM(US_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(US_QF_Appears)
0                 440

Need to fix Aus and Fr

In [53]:
pd.read_sql(
    """
    SELECT SUM(Aus_QF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Aus_QF_Wins)
0               218

In [52]:
pd.read_sql(
    """
    SELECT SUM(Aus_SF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Aus_SF_Wins)
0               110

In [57]:
pd.read_sql(
    """
    SELECT Player, Aus_QF_Wins, Aus_QF_Appears
    FROM mens_tennis
    WHERE Aus_QF_Wins BETWEEN 2 AND 15
    ORDER BY Aus_QF_Wins DESC, Player
    """
, con)

                 Player  Aus_QF_Wins  Aus_QF_Appears
0        Federer, Roger           15              15
1       Djokovic, Novak           10              13
2        Edberg, Stefan            8              10
3           Lendl, Ivan            7               8
4         Nadal, Rafael            7              14
5         Agassi, Andre            6               7
6          Murray, Andy            6               7
7         Sampras, Pete            5               6
8        Wilander, Mats            5               5
9         Roddick, Andy            4               6
10        Rosewall, Ken            4               5
11     Vilas, Guillermo            4               4
12      Alexander, John            3               5
13         Ashe, Arthur            3               4
14       Chang, Michael            3               3
15         Courier, Jim            3               5
16          Haas, Tommy            3               3
17         Kriek, Johan            3               5
18       Newcombe, John            3               8
19        Pfister, Hank            3               3
20         Safin, Marat            3               3
21       Wawrinka, Stan            3               5
22        Becker, Boris            2               4
23       Berdych, Tomas            2               7
24            Cash, Pat            2               4
25         Cilic, Marin            2               2
26       Connors, Jimmy            2               2
27         Crealy, Dick            2               4
28        Denton, Steve            2               2
29      Edmondson, Mark            2               4
30      Ferreira, Wayne            2               3
31        Ferrer, David            2               6
32  Kafelnikov, Yevgeny            2               5
33     Medvedev, Daniil            2               2
34       Muster, Thomas            2               3
35          Roche, Tony            2               5
36         Ruffels, Ray            2               4
37  Tsitsipas, Stefanos            2               2
38  Tsonga, Jo-Wilfried            2               5

Tsitsipas not properly updated

In [63]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Tsitsipas, Stefanos'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,73,"Tsitsipas, Stefanos",7,6,2,0,4,4,1,0,...,1,0,0,0,0,0,0,0,0,0

In [64]:
pd.read_sql(
    """
    SELECT SUM(Aus_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(Aus_QF_Appears)
0                  440

In [65]:
pd.read_sql(
    """
    SELECT SUM(Aus_QF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Aus_QF_Wins)
0               220

In [66]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Appears)
0                 442

In [68]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Wins)
0              220

In [70]:
pd.read_sql(
    """
    SELECT SUM(Fr_SF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_SF_Wins)
0              110

In [71]:
pd.read_sql(
    """
    SELECT SUM(Fr_F_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_F_Wins)
0              55

In [72]:
pd.read_sql(
    """
    SELECT Player, Fr_F_Wins
    FROM mens_tennis
    WHERE Fr_F_Wins > 1
    ORDER BY Fr_F_Wins DESC
    """
, con)

             Player  Fr_F_Wins
0     Nadal, Rafael         14
1       Borg, Bjorn          6
2       Lendl, Ivan          3
3    Wilander, Mats          3
4  Kuerten, Gustavo          3
5   Djokovic, Novak          2
6      Courier, Jim          2
7        Kodes, Jan          2
8   Bruguera, Sergi          2

Djokovic not properly updated

In [74]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Djokovic, Novak'
    """
, con).T

                              0
index                         2
Player          Djokovic, Novak
QF_Appears                   55
QF_Wins                      45
SF_Wins                      34
F_Wins                       23
Aus_QF_Appears               13
Aus_QF_Wins                  10
Aus_SF_Wins                  10
Aus_F_Wins                   10
Fr_QF_Appears                17
Fr_QF_Wins                   12
Fr_SF_Wins                    7
Fr_F_Wins                     3
Wim_QF_Appears               13
Wim_QF_Wins                  11
Wim_SF_Wins                   8
Wim_F_Wins                    7
US_QF_Appears                12
US_QF_Wins                   12
US_SF_Wins                    9
US_F_Wins                     3

In [124]:
pd.read_sql(
    """
    SELECT SUM(Fr_F_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_F_Wins)
0              56

In [125]:
pd.read_sql(
    """
    SELECT SUM(Fr_SF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_SF_Wins)
0              113

In [77]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Ruud, Casper'
    """
, con).T

                           0
index                    368
Player          Ruud, Casper
QF_Appears                 2
QF_Wins                    2
SF_Wins                    2
F_Wins                     0
Aus_QF_Appears             0
Aus_QF_Wins                0
Aus_SF_Wins                0
Aus_F_Wins                 0
Fr_QF_Appears              1
Fr_QF_Wins                 1
Fr_SF_Wins                 1
Fr_F_Wins                  0
Wim_QF_Appears             0
Wim_QF_Wins                0
Wim_SF_Wins                0
Wim_F_Wins                 0
US_QF_Appears              1
US_QF_Wins                 1
US_SF_Wins                 1
US_F_Wins                  0

Ruud not properly updated

In [80]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Ruud, Casper'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,368,"Ruud, Casper",3,3,3,0,0,0,0,0,...,2,0,0,0,0,0,1,1,1,0

In [142]:
pd.read_sql(
    """
    SELECT SUM(Fr_SF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_SF_Wins)
0              112

In [82]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Wins)
0              222

In [83]:
con.close()

In [84]:
con = sqlite3.connect("../data/tennis.db")

In [93]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Wins)
0              222

In [122]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Appears)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Appears)
0                 448

In [110]:
con.commit()

In [134]:
pd.read_sql(
    """
    SELECT SUM(Fr_QF_Wins)
    FROM mens_tennis
    """
, con)

   SUM(Fr_QF_Wins)
0              224

In [140]:
pd.read_sql(
    """
    SELECT *
    FROM mens_tennis
    WHERE Player = 'Alcaraz, Carlos'
    """
, con)

,index,Player,QF_Appears,QF_Wins,SF_Wins,F_Wins,Aus_QF_Appears,Aus_QF_Wins,Aus_SF_Wins,Aus_F_Wins,...,Fr_SF_Wins,Fr_F_Wins,Wim_QF_Appears,Wim_QF_Wins,Wim_SF_Wins,Wim_F_Wins,US_QF_Appears,US_QF_Wins,US_SF_Wins,US_F_Wins
0,365,"Alcaraz, Carlos",4,2,2,1,0,0,0,0,...,1,0,0,0,0,0,2,1,1,1

In [143]:
con.commit()

In [144]:
con.close()